#+STARTIP: overview
* interface tweaks 
#+BEGIN_SRC emacs-lisp
(tool-bar-mode -1)
(scroll-bar-mode -1)
(setq inhibit-startup-screen t)
(fset 'yes-or-no-p 'y-or-n-p)
(require 'org-tempo)

#+END_SRC

adjust the window size and transparency
#+begin_src emacs-lisp
(when window-system (set-frame-size (selected-frame) 160 50))
 (set-frame-parameter (selected-frame) 'alpha '(85 . 50))
 (add-to-list 'default-frame-alist '(alpha . (85 . 50)))
#+end_src

#+RESULTS:
: ((alpha 85 . 50) (alpha 80 . 50) (alpha 95 . 50) (vertical-scroll-bars))

